{"optimizer": {"lr": 0.009999999776482582, "decay": 9.999999974752427e-07, "momentum": 0.8999999761581421, "name": "SGD", "nesterov": true}, "loss": "categorical_crossentropy", "sample_weight_mode": null, "class_name": "Sequential", "keras_version": "1.0.6", "config": [{"class_name": "ZeroPadding2D", "config": {"batch_input_shape": [null, 1, 112, 112], "input_dtype": "float32", "name": "zeropadding2d_1", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv1_1", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_2", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv1_2", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout_1", "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_3", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv2_1", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_4", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv2_2", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "name": "maxpooling2d_2", "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_5", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv3_1", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_6", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv3_2", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_7", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv3_3", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_8", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv3_4", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "name": "maxpooling2d_3", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout_2", "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_9", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv4_1", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_10", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv4_2", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_11", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv4_3", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_12", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv4_4", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "name": "maxpooling2d_4", "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_13", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv5_1", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_14", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv5_2", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_15", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv5_3", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_16", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "b_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "b_regularizer": null, "name": "conv5_4", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "name": "maxpooling2d_5", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "output_dim": 1024, "bias": true, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_1", "input_dim": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "output_dim": 1024, "bias": true, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_2", "input_dim": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_5", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "output_dim": 2, "bias": true, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_3", "input_dim": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}]}